In [41]:
import pandas as pd  #import all libraries
import matplotlib.pyplot as plt 
df = pd.read_csv("/Users/jastisarika/Downloads/data_jobs.csv")  #load the csv file

df["job_posted_date"] = pd.to_datetime(df.job_posted_date)
df.head(5)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,NaN,NaN,NaN,Boehringer Ingelheim,NaN,NaN
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,NaN,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,NaN,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,NaN,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,NaN,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785740 non-null  object
 2   job_location           784696 non-null  object
 3   job_via                785733 non-null  object
 4   job_schedule_type      773074 non-null  object
 5   job_work_from_home     785741 non-null  bool
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  datetime64[ns]
 8   job_no_degree_mention  785741 non-null  bool
 9   job_health_insurance   785741 non-null  bool
 10  job_country            785692 non-null  object
 11  salary_rate            33067 non-null   object
 12  salary_year_avg        22003 non-null   float64
 13  salary_hour_avg        10662 non-null   float64
 14  company_name           785723 non-null  object
 15  job_skills             668704 non-null  object
 16  job_type_skills        668704 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 86.2+ MB

In [43]:
df["salary_year_avg"]   # here we have bunch of nan values , filter nan values...so we need to get notna values from the df and retrieve only one column 
df[pd.notna(df["salary_year_avg"])]["salary_year_avg"]

28        109500.0
77        140000.0
92        120000.0
100       228222.0
109        89000.0
            ...
785624    139216.0
785641    150000.0
785648    221875.0
785682    157500.0
785692    157500.0
Name: salary_year_avg, Length: 22003, dtype: float64

In [44]:
#APPLY() - now we want to calculate projected salary fro the next year .. we are going to do aome rough maths .. what inflation is and calcualte 
#3% = 1.03*salary how to apply this to the entire column 

#we can apply in many ways ,,... 1.one way is to create a function and apply it column by using apply()

# def projected_salary(salary):                     # now after creating a func, we have to take salary avg yeaar col and apply this func on it 
#     return salary * 1.03

# df["salary_year_avg"].apply(projected_salary)     #it has nan values , we cannot apply on nan values, filter them out using notna and create a another df


# df_salary = df[pd.notna(df["salary_year_avg"])]

In [45]:
df_salary = df[pd.notna(df["salary_year_avg"])].copy()
def projected_salary(salary):
    return salary * 1.03

df_salary["salary_year_inflated"] = df_salary["salary_year_avg"].apply(projected_salary)    #now lets inspect how it differes with original dalry_yearavg column

In [49]:
df_salary[["salary_year_avg","salary_year_inflated"]]

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

In [51]:
df['job_skills'][2]   #here the list has double quotes

"['python', 'sql', 'c#', 'azure', 'airflow', 'dax', 'docker', 'kubernetes', 'jenkins']"

In [52]:
type('job_skills')  
#as we see here , the skill_list is a list but it is stored in str data type.. now we have convert the str in to list ... lets see how we do it

str

In [55]:
# we are going to use abstract syntax trees literal eval to convert string in to list   ast.literal_eval
import ast

In [58]:
ast.literal_eval(df["job_skills"][2])  #here we cant directly pass the entire column to channge data type , we have use appply() to apply it on entire column

['python',
 'sql',
 'c#',
 'azure',
 'airflow',
 'dax',
 'docker',
 'kubernetes',
 'jenkins']

In [60]:
#create a func
def clean_list(skill_list):
    if pd.notna(skill_list):         #literal eval cannot be applied on nan values, so we have use if function to chck fpr nan values 
       return ast.literal_eval(skill_list)
df["job_skills"] = df["job_skills"].apply(clean_list)

In [61]:
df["job_skills"][2]

['python',
 'sql',
 'c#',
 'azure',
 'airflow',
 'dax',
 'docker',
 'kubernetes',
 'jenkins']

In [65]:
#lets use lambda function 

# df["job_skills"] = df["job_skills"].apply(lambda skill_list:ast.literal_eval(skill_list) if pd.notna(skill_list) else skill_list )

calculate projected salary for next year 
assume senior roles - 5%
for other roles -3%

In [80]:
#now we see how to apply() on rows with spcified columns  
def projected_salary(row):
    if 'senior' in row['job_title_short']:
        return  1.05 * row["salary_year_avg"]
    else:
        return   1.03 * row["salary_year_avg"]
    
df_salary["salary_year_inflated"] = df_salary.apply(projected_salary,axis =1)

df_salary[["job_title_short","salary_year_avg",'salary_year_inflated']]

       job_title_short  salary_year_avg  salary_year_inflated
28      Data Scientist         109500.0             112785.00
77       Data Engineer         140000.0             144200.00
92       Data Engineer         120000.0             123600.00
100     Data Scientist         228222.0             235068.66
109       Data Analyst          89000.0              91670.00
...                ...              ...                   ...
785624   Data Engineer         139216.0             143392.48
785641   Data Engineer         150000.0             154500.00
785648  Data Scientist         221875.0             228531.25
785682  Data Scientist         157500.0             162225.00
785692  Data Scientist         157500.0             162225.00

[22003 rows x 3 columns]